vks007/home_automation/ESPNowGateway_ESP8266/src/main.cpp
/*
 * runs the loop to check for incoming messages in the queue, picks them up and posts them to MQTT
 */
void loop() {
  //check for MQTT connection
  if (!client.connected()) 
  {
    reconnectMQTT(); // Attempt to reconnect
  } else {
    client.loop(); // Client connected
  }
  MQTT_wd.update(client.connected()); //feed the watchdog by calling update
  
  #if USING(MOTION_SENSOR)
    update_motion_sensor();
  #endif

  ArduinoOTA.handle();
  if(client.connected())
  {
    if(!structQueue.isEmpty())
      if(!retry_message)
        currentMessage = structQueue.dequeue();
      //else last message content is still there is currentMessage
    
    if(currentMessage != emptyMessage)
    {
      DPRINTFLN("Processing msg:%lu,%d",currentMessage.message_id,currentMessage.msg_type);
      if(currentMessage.msg_type == ESPNOW_SENSOR)
      {
        if(publishToMQTT(currentMessage))
        {
          gateway.msg_count++;
          currentMessage = emptyMessage;
        }
        else
        {
          retry_message = true;
        }//else the same message will be retried the next time
      }
      else if(currentMessage.msg_type == ESPNOW_COMMAND)
      {
        if(process_command_message(currentMessage))
        {
          gateway.msg_count++;
          gateway.cmnd_msg_count++;
          currentMessage = emptyMessage;
        }
        else
        {
          retry_message = true;
        }//else the same message will be retried the next time
      }
      #if(USING(ESPNOW_OTA_SERVER))
      else if(currentMessage.msg_type == ESPNOW_OTA)
      {
        if(esp_ota_device.ota_mode)
        {
          char buffer[18];
          sprintf(buffer, "%02X:%02X:%02X:%02X:%02X:%02X",esp_ota_device.mac[0],esp_ota_device.mac[1],esp_ota_device.mac[2],esp_ota_device.mac[3],esp_ota_device.mac[4],esp_ota_device.mac[5] );
          if(xstrcmp(buffer,currentMessage.sender_mac))
          {
            esp_ota_device.ota_mode = false;
            esp_ota_device.ota_done = true;
            delete_peer(esp_ota_device.mac);// now that we're done with OTA , delete the peer
            DPRINTLN("OTA successfuly completed for device:");
          }
          else
            {DPRINTFLN("MAC address of OTA device did not match. Target mac: %s , MAC in msg: %s",buffer,currentMessage.sender_mac);}
        }
        else
          DPRINTLN("OTA ack message received when not in OTA mode, ignoring...");
        // pubish the OTA message to MQTT
        publishToMQTT(currentMessage);
        gateway.msg_count++;
        currentMessage = emptyMessage;
      }
      #endif
      else
      {
        DPRINTLN("message received without msg_type set, ignoring...");
        gateway.msg_count++;
        currentMessage = emptyMessage;
      }
    }
  }

  // try to publish health message irrespective of the state of espnow messages
  if(millis() - last_time > HEALTH_INTERVAL)
  {
    // It might be possible when the ESP comes up MQTT is down, in that case an init message will not get published in setup()
    // The statement below will check and publish the same , only once
    if(!initilized)
    {
      if(publishHealthMessage(true))
        initilized = true;
    }
    //Now publish the health message
    update_gateway_stats();
    publishHealthMessage();
    last_time = millis(); // This is reset irrespective of a successful publish else the main loop will continously try to publish this message
  }
  statusLED.loop();

  #if(USING(ESPNOW_OTA_SERVER))
    if(esp_ota_device.ota_mode && !esp_ota_device.ota_done)
    {
      if(millis() < (start_time + esp_ota_device.duration*1000))
      {
        if((millis() - last_msg_sent_time) > esp_ota_device.interval)
        {
          myData.message_id = millis();
          bool result = sendESPnowMessage(&myData,esp_ota_device.mac,0,false);
          last_msg_sent_time = millis();
          //yield();// trying this out to see if the MQTT disconect bug gets solved
          if(result)
          {
            //DPRINTFLN("%lu: sent OTA message",myData.message_id);
          }
          else
          {
            DPRINTFLN("%lu: OTA message sending failed",myData.message_id);}
        }
      }
      else
      {
        esp_ota_device.ota_mode = false;
        esp_ota_device.ota_done = true;
        delete_peer(esp_ota_device.mac);// now that we're done with OTA , delete the peer
        DPRINTLN("OTA timed out without acknowlegdment from device");
      }
    }
  #endif

}
